# Tipos de imóveis

In [166]:
import pandas as pd

In [167]:
dados = pd.read_csv('datasets/aluguel.csv', sep = ';')

In [168]:
dados.head(10)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
5,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN
6,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0
7,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000.0,NaN,NaN
8,Casa de Condomínio,Ramos,2,2,0,65,1000.0,NaN,NaN
9,Conjunto Comercial/Sala,Centro,0,3,0,695,35000.0,19193.0,3030.0

In [169]:
dados['Tipo']

0                      Quitinete
1                           Casa
2        Conjunto Comercial/Sala
3                    Apartamento
4                    Apartamento
                  ...
32955                  Quitinete
32956                Apartamento
32957                Apartamento
32958                Apartamento
32959    Conjunto Comercial/Sala
Name: Tipo, Length: 32960, dtype: object

In [170]:
tipo_de_imovel = dados['Tipo']

In [171]:
type(tipo_de_imovel)

pandas.core.series.Series

In [172]:
tipo_de_imovel.drop_duplicates(inplace=True)

In [173]:
tipo_de_imovel

0                          Quitinete
1                               Casa
2            Conjunto Comercial/Sala
3                        Apartamento
7                 Casa de Condomínio
16                    Prédio Inteiro
17                              Flat
29                        Loja/Salão
80           Galpão/Depósito/Armazém
83                    Casa Comercial
117                     Casa de Vila
159                   Terreno Padrão
207                      Box/Garagem
347                             Loft
589      Loja Shopping/ Ct Comercial
2157                         Chácara
3354           Loteamento/Condomínio
4379                           Sítio
4721                   Pousada/Chalé
6983                          Studio
9687                           Hotel
23614                      Indústria
Name: Tipo, dtype: object

## Organizando a visualização

In [174]:
tipo_de_imovel = pd.DataFrame(tipo_de_imovel)

In [175]:
tipo_de_imovel

                              Tipo
0                        Quitinete
1                             Casa
2          Conjunto Comercial/Sala
3                      Apartamento
7               Casa de Condomínio
16                  Prédio Inteiro
17                            Flat
29                      Loja/Salão
80         Galpão/Depósito/Armazém
83                  Casa Comercial
117                   Casa de Vila
159                 Terreno Padrão
207                    Box/Garagem
347                           Loft
589    Loja Shopping/ Ct Comercial
2157                       Chácara
3354         Loteamento/Condomínio
4379                         Sítio
4721                 Pousada/Chalé
6983                        Studio
9687                         Hotel
23614                    Indústria

In [176]:
tipo_de_imovel.index

Int64Index([    0,     1,     2,     3,     7,    16,    17,    29,    80,
               83,   117,   159,   207,   347,   589,  2157,  3354,  4379,
             4721,  6983,  9687, 23614],
           dtype='int64')

In [177]:
tipo_de_imovel.index = range(tipo_de_imovel.shape[0]) # ou len(tipo_de_imovel)

In [178]:
tipo_de_imovel.index

RangeIndex(start=0, stop=22, step=1)

In [179]:
tipo_de_imovel

                           Tipo
0                     Quitinete
1                          Casa
2       Conjunto Comercial/Sala
3                   Apartamento
4            Casa de Condomínio
5                Prédio Inteiro
6                          Flat
7                    Loja/Salão
8       Galpão/Depósito/Armazém
9                Casa Comercial
10                 Casa de Vila
11               Terreno Padrão
12                  Box/Garagem
13                         Loft
14  Loja Shopping/ Ct Comercial
15                      Chácara
16        Loteamento/Condomínio
17                        Sítio
18                Pousada/Chalé
19                       Studio
20                        Hotel
21                    Indústria

In [180]:
tipo_de_imovel.columns.name = 'Id'

In [181]:
tipo_de_imovel

Id                         Tipo
0                     Quitinete
1                          Casa
2       Conjunto Comercial/Sala
3                   Apartamento
4            Casa de Condomínio
5                Prédio Inteiro
6                          Flat
7                    Loja/Salão
8       Galpão/Depósito/Armazém
9                Casa Comercial
10                 Casa de Vila
11               Terreno Padrão
12                  Box/Garagem
13                         Loft
14  Loja Shopping/ Ct Comercial
15                      Chácara
16        Loteamento/Condomínio
17                        Sítio
18                Pousada/Chalé
19                       Studio
20                        Hotel
21                    Indústria

## Extra -  Estruturas de dados

In [182]:
data = [1, 2, 3, 4, 5]

In [183]:
s = pd.Series(data)

In [184]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [185]:
index = ['Linha' + str(i) for i in range(5)]

In [186]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [187]:
s = pd.Series(data=data, index=index)

In [188]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [189]:
data = {'Linha' + str(i) : i + 1 for i in range(5) }

In [190]:
s = pd.Series(data)

In [191]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [192]:
s1 = s + 2

In [193]:
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [194]:
s2 =  s + s1

In [195]:
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

## Extra - Dataframes

In [196]:
data = [[1, 2, 3], 
        [4, 5, 6], 
        [7, 8, 9]]

In [197]:
df1 = pd.DataFrame(data = data)

In [198]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [199]:
index = ['Linha' + str(i) for i in range(3)]

In [200]:
index

['Linha0', 'Linha1', 'Linha2']

In [201]:
df1 = pd.DataFrame(data = data, index = index)

In [202]:
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [203]:
columns = ['Coluna' + str(i) for i in range(3)]

In [204]:
columns

['Coluna0', 'Coluna1', 'Coluna2']

In [205]:
df1 = pd.DataFrame(data = data, index = index, columns = columns)

In [206]:
df2 = pd.DataFrame(data = data, index = index, columns = columns)

In [207]:
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [208]:
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [209]:
data

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [210]:
data = [(1, 2, 3), 
        (4, 5, 6), 
        (7, 8, 9)]

In [211]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)

In [212]:
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [213]:
df1[df1 > 2] = 'A'
df1

       Coluna0 Coluna1 Coluna2
Linha0       1       2       A
Linha1       A       A       A
Linha2       A       A       A

In [214]:
df2[df2 > 1] = 'B'
df2

       Coluna0 Coluna1 Coluna2
Linha0       1       B       B
Linha1       B       B       B
Linha2       B       B       B

In [215]:
df3[df3 > 0] = 'C'
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [216]:
df4 = pd.concat([df1, df2, df3])
df4

       Coluna0 Coluna1 Coluna2
Linha0       1       2       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       1       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [217]:
df4 = pd.concat([df1, df2, df3], axis = 1)
df4

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0       1       2       A       1       B       B       C       C       C
Linha1       A       A       A       B       B       B       C       C       C
Linha2       A       A       A       B       B       B       C       C       C